Конфигурация/Catalogs/Векселя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Векселя</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВекселя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВекселей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентГодовых</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПогашения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПогашенияВекселей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейДоПогашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаНачисленияПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогаситьНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйАктивЦБРФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУчетныхАктивовЦБРФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ТипыВекселей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыВекселей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процентный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/Векселя/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.ГруппаПроценты.Видимость = (Объект.ТипВекселя = ПредопределенноеЗначение("Перечисление.ТипыВекселей.Процентный"));
	
	Если      Объект.ВариантПогашения = ПредопределенноеЗначение("Перечисление.ВариантыПогашенияВекселей.НаДату") Тогда
		Элементы.ДатаПогашения.Видимость     = Истина;
		Элементы.ДатаПогашения.Доступность   = Истина;
		Элементы.ДнейДоПогашения.Видимость   = Ложь;
		Элементы.ПогаситьНеПозднее.Видимость = Ложь;
		
	ИначеЕсли Объект.ВариантПогашения = ПредопределенноеЗначение("Перечисление.ВариантыПогашенияВекселей.ПоПредъявлении") Тогда
		Элементы.ДатаПогашения.Видимость     = Ложь;
		Элементы.ДатаПогашения.Доступность   = Ложь;
		Элементы.ДнейДоПогашения.Видимость   = Ложь;
		Элементы.ПогаситьНеПозднее.Видимость = Ложь;
		
	ИначеЕсли Объект.ВариантПогашения = ПредопределенноеЗначение("Перечисление.ВариантыПогашенияВекселей.ПоПредъявленииНоНеРанее") Тогда
		Элементы.ДатаПогашения.Видимость     = Истина;
		Элементы.ДатаПогашения.Доступность   = Истина;
		Элементы.ДнейДоПогашения.Видимость   = Ложь;
		Элементы.ПогаситьНеПозднее.Видимость = Ложь;
		
	ИначеЕсли Объект.ВариантПогашения = ПредопределенноеЗначение("Перечисление.ВариантыПогашенияВекселей.ПоПредъявленииНоНеПозднее") Тогда
		Элементы.ДатаПогашения.Видимость     = Истина;
		Элементы.ДатаПогашения.Доступность   = Истина;
		Элементы.ДнейДоПогашения.Видимость   = Ложь;
		Элементы.ПогаситьНеПозднее.Видимость = Истина;
		
	ИначеЕсли Объект.ВариантПогашения = ПредопределенноеЗначение("Перечисление.ВариантыПогашенияВекселей.ЧерезNДнейОтДатыСоставления") Тогда
		Элементы.ДатаПогашения.Видимость     = Истина;
		Элементы.ДатаПогашения.Доступность   = Ложь;
		Элементы.ДнейДоПогашения.Видимость   = Истина;
		Элементы.ПогаситьНеПозднее.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // НастроитьВидимостьДоступность

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокСсылкиОбновить(ЭтаФорма, Объект.Ссылка);
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаКлиенте
Функция РассчитатьДатуПогашения()
	
	Объект.ДатаПогашения = Объект.ДатаСоставления + Объект.ДнейДоПогашения;
	
КонецФункции // РассчитатьДатуПогашения

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();

	УстановитьОтборыПоВедомымРегистрам(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипВекселяПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПогашенияПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСоставленияПриИзменении(Элемент)
	
	РассчитатьДатуПогашения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДнейДоПогашенияПриИзменении(Элемент)
	
	РассчитатьДатуПогашения();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновитьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Вопрос("Обновить текущий элемент?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		РаботаСВнешнимиСистемами.ОбновитьРеквизитыОбъектаИзМатрикс(Объект.Ссылка);
		
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборыПоВедомымРегистрам(Форма)
	
	Объект = Форма.Объект;
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Форма.УсловияРасчетаПроцентовВекселей.Отбор, "Вексель",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);

КонецПроцедуры
